# STEP 1: IMPORTING OUR LIBRARIES

In [224]:
import numpy as np
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt
import sklearn

from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import train_test_split

# STEP 2: LOADING OUR DATASET

In [225]:
train = pd.read_csv("Train.csv")
test = pd.read_csv("Test.csv")

# To check our train dataset
display(train.head())

,VehicleID,Location,Maker,Model,Year,Colour,Amount (Million Naira),Type,Distance
0,VHL12546,Abuja,Honda,Accord Coupe EX V-6,"2,011",Silver,2.2,Nigerian Used,NaN
1,VHL18827,Ibadan,Hyundai,Sonata,"2,012",Silver,3.5,Nigerian Used,"125,000"
2,VHL19499,Lagos,Lexus,RX 350,"2,010",Red,9.2,Foreign Used,"110,852"
3,VHL17991,Abuja,Mercedes-Benz,GLE-Class,"2,017",Blue,22.8,Foreign Used,"30,000"
4,VHL12170,Ibadan,Toyota,Highlander,"2,002",Red,2.6,Nigerian Used,"125,206"

In [226]:
#To check our test dataset
display(test.head())

,VehicleID,Location,Maker,Model,Year,Colour,Type,Distance
0,VHL18518,Abuja,BMW,323i,"2,008",White,Foreign Used,30524.0
1,VHL17149,Lagos,Toyota,Camry,"2,013",White,Foreign Used,NaN
2,VHL10927,Lagos,Toyota,Highlander Limited V6,"2,005",Gold,Foreign Used,NaN
3,VHL12909,Lagos,Toyota,Camry,"2,011",Gray,Foreign Used,166839.0
4,VHL12348,Lagos,Lexus,ES 350 FWD,"2,013",Red,Foreign Used,88862.0

In [227]:
#Information on our train dataset

train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7205 entries, 0 to 7204
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   VehicleID               7205 non-null   object
 1   Location                7205 non-null   object
 2   Maker                   7205 non-null   object
 3   Model                   7205 non-null   object
 4   Year                    7184 non-null   object
 5   Colour                  7205 non-null   object
 6   Amount (Million Naira)  7188 non-null   float64
 7   Type                    7008 non-null   object
 8   Distance                4845 non-null   object
dtypes: float64(1), object(8)
memory usage: 506.7+ KB

In [228]:
#Information on our test dataset
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2061 entries, 0 to 2060
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   VehicleID  2061 non-null   object
 1   Location   2061 non-null   object
 2   Maker      2061 non-null   object
 3   Model      2061 non-null   object
 4   Year       2059 non-null   object
 5   Colour     2061 non-null   object
 6   Type       2007 non-null   object
 7   Distance   1385 non-null   float64
dtypes: float64(1), object(7)
memory usage: 128.9+ KB

In [229]:
#To get some descriptive statistics on our train dataset
train.describe()

       Amount (Million Naira)
count             7188.000000
mean                11.847999
std                 25.318922
min                  0.450000
25%                  3.500000
50%                  5.650000
75%                 11.662500
max                456.000000

In [230]:
#To get some descriptive statistics on our test dataset
test.describe()

            Distance
count    1385.000000
mean   103800.668592
std    105986.234512
min         1.000000
25%     52352.000000
50%     82000.000000
75%    120398.000000
max    985216.000000

# STEP 3: Cleaning our dataset

In [231]:
train.columns

Index(['VehicleID', 'Location', 'Maker', 'Model', 'Year', 'Colour',
       'Amount (Million Naira)', 'Type', 'Distance'],
      dtype='object')

In [232]:
test.columns

Index(['VehicleID', 'Location', 'Maker', 'Model', 'Year', 'Colour', 'Type',
       'Distance'],
      dtype='object')

In [233]:
#Check for missing value on our train dataset
train.isnull().sum()

VehicleID                    0
Location                     0
Maker                        0
Model                        0
Year                        21
Colour                       0
Amount (Million Naira)      17
Type                       197
Distance                  2360
dtype: int64

In [234]:
#Check for missing value on our test dataset
test.isnull().sum()

VehicleID      0
Location       0
Maker          0
Model          0
Year           2
Colour         0
Type          54
Distance     676
dtype: int64

In [235]:
#Remove train rows for missing values and reset numbering

train = train[~train["Amount (Million Naira)"].isnull()].reset_index(drop=True)
train = train[~train["Year"].isnull()].reset_index(drop=True)
train = train[~train["Type"].isnull()].reset_index(drop=True)
train = train[~train["Distance"].isnull()].reset_index(drop=True)

In [236]:
train.isnull().sum()

VehicleID                 0
Location                  0
Maker                     0
Model                     0
Year                      0
Colour                    0
Amount (Million Naira)    0
Type                      0
Distance                  0
dtype: int64

In [237]:
train = train.drop("VehicleID", axis=1)
test = test.drop("VehicleID", axis=1)

In [238]:
train.head()

,Location,Maker,Model,Year,Colour,Amount (Million Naira),Type,Distance
0,Ibadan,Hyundai,Sonata,"2,012",Silver,3.50,Nigerian Used,"125,000"
1,Lagos,Lexus,RX 350,"2,010",Red,9.20,Foreign Used,"110,852"
2,Abuja,Mercedes-Benz,GLE-Class,"2,017",Blue,22.80,Foreign Used,"30,000"
3,Ibadan,Toyota,Highlander,"2,002",Red,2.60,Nigerian Used,"125,206"
4,Lagos,Toyota,Sienna,"2,012",Blue,7.76,Foreign Used,"350,882"

In [239]:
test.head()

,Location,Maker,Model,Year,Colour,Type,Distance
0,Abuja,BMW,323i,"2,008",White,Foreign Used,30524.0
1,Lagos,Toyota,Camry,"2,013",White,Foreign Used,NaN
2,Lagos,Toyota,Highlander Limited V6,"2,005",Gold,Foreign Used,NaN
3,Lagos,Toyota,Camry,"2,011",Gray,Foreign Used,166839.0
4,Lagos,Lexus,ES 350 FWD,"2,013",Red,Foreign Used,88862.0

In [240]:
#label encoding
cat_features = ["Location","Maker","Year","Colour","Type","Model","Distance"]

for cat_feature in cat_features:
  train[f"{cat_feature}_cat"] = train[cat_feature].astype('category')
  train[f"{cat_feature}_cat"] = train[f"{cat_feature}_cat"].cat.codes

cat_features = ["Location","Maker","Year","Colour","Type", "Model","Distance"]
    
for cat_feature in cat_features:
  test[f"{cat_feature}_cat"] = test[cat_feature].astype('category')
  test[f"{cat_feature}_cat"] = test[f"{cat_feature}_cat"].cat.codes

In [241]:
train.head()

,Location,Maker,Model,Year,Colour,Amount (Million Naira),Type,Distance,Location_cat,Maker_cat,Year_cat,Colour_cat,Type_cat,Model_cat,Distance_cat
0,Ibadan,Hyundai,Sonata,"2,012",Silver,3.50,Nigerian Used,"125,000",1,16,20,14,2,828,443
1,Lagos,Lexus,RX 350,"2,010",Red,9.20,Foreign Used,"110,852",2,25,18,13,1,718,222
2,Abuja,Mercedes-Benz,GLE-Class,"2,017",Blue,22.80,Foreign Used,"30,000",0,30,25,2,1,391,1334
3,Ibadan,Toyota,Highlander,"2,002",Red,2.60,Nigerian Used,"125,206",1,46,10,13,2,440,447
4,Lagos,Toyota,Sienna,"2,012",Blue,7.76,Foreign Used,"350,882",2,46,20,2,1,801,1468

In [242]:
display(test.head())

,Location,Maker,Model,Year,Colour,Type,Distance,Location_cat,Maker_cat,Year_cat,Colour_cat,Type_cat,Model_cat,Distance_cat
0,Abuja,BMW,323i,"2,008",White,Foreign Used,30524.0,0,2,14,16,1,8,131
1,Lagos,Toyota,Camry,"2,013",White,Foreign Used,NaN,2,37,19,16,1,123,-1
2,Lagos,Toyota,Highlander Limited V6,"2,005",Gold,Foreign Used,NaN,2,37,11,7,1,272,-1
3,Lagos,Toyota,Camry,"2,011",Gray,Foreign Used,166839.0,2,37,17,8,1,123,838
4,Lagos,Lexus,ES 350 FWD,"2,013",Red,Foreign Used,88862.0,2,20,19,12,1,192,528

In [243]:
# Dropping the reductant train features since we've done our Label encoding
train.drop(["Location","Maker","Year","Colour", "Type", "Model", "Distance"], axis=1, inplace=True)

In [244]:
train.head()

,Amount (Million Naira),Location_cat,Maker_cat,Year_cat,Colour_cat,Type_cat,Model_cat,Distance_cat
0,3.50,1,16,20,14,2,828,443
1,9.20,2,25,18,13,1,718,222
2,22.80,0,30,25,2,1,391,1334
3,2.60,1,46,10,13,2,440,447
4,7.76,2,46,20,2,1,801,1468

In [245]:
# Dropping the reductant test features since we've done our Label encoding
test.drop(["Location","Maker","Year","Colour", "Type", "Model","Distance"], axis=1, inplace=True)

In [246]:
test.head()

,Location_cat,Maker_cat,Year_cat,Colour_cat,Type_cat,Model_cat,Distance_cat
0,0,2,14,16,1,8,131
1,2,37,19,16,1,123,-1
2,2,37,11,7,1,272,-1
3,2,37,17,8,1,123,838
4,2,20,19,12,1,192,528

# STEP 4: Data Segmentation

In [247]:
y = train["Amount (Million Naira)"] 
x = train.drop("Amount (Million Naira)", axis=1)

In [258]:
x_train,x_test,y_train,y_test = train_test_split(x, y, test_size=0.3)

# Step 5: Loading data into the Linear Regression model(Training our model)

In [259]:
from sklearn.linear_model import LinearRegression

reg = LinearRegression()
reg.fit(x_train, y_train)

LinearRegression()

# STEP 6: Predictions

In [260]:
reg.predict(x_test)

array([  2.60857945, -17.55800286,  10.83997659, ...,   4.8932545 ,
       -21.17564684,  19.070353  ])

# STEP 7: Evaluate our models

In [261]:
from sklearn.metrics import mean_absolute_error


y_pred = reg.predict(x_test)

print("MAE",mean_absolute_error(y_test,y_pred))

MAE 7.553281067872552

In [263]:
from sklearn.metrics import mean_squared_error

y_pred = reg.predict(x_test)
print("MSE", mean_squared_error(y_test,y_pred))

MSE 316.73311597137456

In [265]:
rmse=mean_squared_error(y_test,y_pred,squared =False)
rmse

17.796997386395677

# Prediction with test dataset

In [266]:
test_pred = reg.predict(test)

In [268]:
test_pred

array([ 6.4881579 , 11.79851685,  1.00444734, ..., 17.92102909,
       15.47730894,  8.86115304])


# Export our submission file

In [273]:
sub = pd.read_csv("SampleSubmission.csv")
sub.head()

  VehicleID  Amount (Million Naira)
0  VHL18518                     1.0
1  VHL17149                     1.0
2  VHL10927                     1.0
3  VHL12909                     1.0
4  VHL12348                     1.0

In [275]:
sub["Amount (Million Naira)"] = test_pred

In [276]:
sub

     VehicleID  Amount (Million Naira)
0     VHL18518                6.488158
1     VHL17149               11.798517
2     VHL10927                1.004447
3     VHL12909                8.088583
4     VHL12348               12.861866
...        ...                     ...
2056  VHL17903               26.538502
2057  VHL14018               14.760610
2058  VHL17473               17.921029
2059  VHL11480               15.477309
2060  VHL13881                8.861153

[2061 rows x 2 columns]